#language:ru
@web @ui @helpdesk
Функционал: UI тестирование сервиса Helpdesk

  Предыстория:
    * открыть url "https://at-sandbox.workbench.lanit.ru/login"
    * инициализация страницы "Авторизация"
    * ввести в поле "поле логина" значение "admin"
    * ввести в поле "поле пароля" значение "adminat"
    * кликнуть на элемент "кнопка входа"

  @edit-ticket
  Сценарий: Редактирование созданного тикета с прикреплением файла
    * шаг № "1"
    * переход на страницу "Список тикетов"
    * на странице имеется элемент "поле поиска"
    * ввести в поле "поле поиска" значение "Не работает кнопка Отправить на форме регистрации"
    * кликнуть на элемент "кнопка поиска"

    * шаг № "2"
    * на странице присутствует часть текста "Не работает кнопка Отправить на форме регистрации"
    * кликнуть на элемент где присутствует часть текста "Не работает кнопка Отправить на форме регистрации"
    * переход на страницу "Страница тикета"

    * шаг № "3"
    * на странице имеется элемент "добавить файлы"
    * кликнуть на элемент "добавить файлы"
    * загрузить файл "suite.xml"
    * проверить что на странице прикреплен файл "suite.xml"

    * закрыть страницу

  @save-search
  Сценарий: Создать поисковой запрос, сохранить его и проверить его наличие

    * шаг № "1"
    * переход на страницу "Список тикетов"

    * шаг № "2"
    * кликнуть на элемент "сортировка"
    * кликнуть на элемент "сортировка по названию"
    * установить чекбокс на элементе "чекбокс обратного порядка"
    * кликнуть на элемент "выпадающий список добавления фильтра"
    * кликнуть на элемент "фильтр на очередь"
    * кликнуть на элемент "очередь тикета"
    * кликнуть на элемент "статус тикета"
    * кликнуть на элемент "кнопка для применения фильтра"
    * кликнуть на элемент "таба для сохранения поискового запроса"
    * ввести в поле "название сохраненного поискового запроса" значение "поисковой запрос"
    * кликнуть на элемент "кнопка сохранить поисковый запрос"

    * шаг № "3"
    * кликнуть на элемент "кнопка для отображения сохраненных запросов"
    * на странице есть название поискового запроса "поисковой запрос"
    * кликнуть на название поискового запроса "поисковой запрос"

    * закрыть страницу